Revit 2024 API
KeyBasedTreeEntryTable Class
 KeyBasedTreeEntryTable represents the collection of key-based tree entries for a document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class KeyBasedTreeEntryTable : Element
Visual Basic
Public Class KeyBasedTreeEntryTable _
	Inherits Element
Visual C++
public ref class KeyBasedTreeEntryTable : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.KeyBasedTreeEntryTable
 Autodesk.Revit.DB.AssemblyCodeTable
 Autodesk.Revit.DB.KeynoteTable
See Also
KeyBasedTreeEntryTable Members
Autodesk.Revit.DB Namespace